### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [3]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [5]:
Players_count = len(purchase_data["SN"].unique())
Players_count

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [7]:
Average_Price = purchase_data["Price"].mean()
Average_Price

3.050987179487176

In [8]:
Number_Unique_Items = len(purchase_data["Item ID"].unique())
Number_Unique_Items

179

In [9]:
Total_Purchases = purchase_data["Item ID"].count()
Total_Purchases

780

In [10]:
Total_Revenue = purchase_data["Price"].sum()
Total_Revenue

2379.77

In [11]:
# Display the summary data frame

summary_df = pd.DataFrame({"Number of Unique Items": [Number_Unique_Items],
                                  "Average Purchase Price": [Average_Price],
                                  "Total Number of Purchases": [Total_Purchases],
                                  "Total Revenue": [Total_Revenue]})

summary_df

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,179,3.050987,780,2379.77

In [12]:
# Remove duplicates in SN column
SN_unique = purchase_data.drop_duplicates(subset=['SN'])
# Count the unique values by gender
gender_counter = SN_unique["Gender"].value_counts()

In [13]:
# Count the unique values by gender
gender_percentage = gender_counter/SN_unique['Gender'].count()*100
gender_percentage

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [14]:
pd.DataFrame({
    'Count': gender_counter,
    'Percentage': gender_percentage
})

                       Count  Percentage
Male                     484   84.027778
Female                    81   14.062500
Other / Non-Disclosed     11    1.909722


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [22]:
Analysis_Gender = purchase_data.groupby(["Gender"])

Purchase_Count = Analysis_Gender["Price"].count().round(2)
Average_Purchase_Price = Analysis_Gender["Price"].mean().round(2)
Total_Purchase_Price = Analysis_Gender["Price"].sum().round(2)
Average_Purchase_Price = (Total_Purchase_Price/purchase_data["Item ID"].count()).round(2)

pd.DataFrame({"Purchase Count": Purchase_Count,
              "Average Purchase Price": Average_Purchase_Price,
              "Total Purchase Price": Total_Purchase_Price,
              "Average Purchase Price": Average_Purchase_Price
             })

,Purchase Count,Average Purchase Price,Total Purchase Price
Gender,,,
Female,113,0.46,361.94
Male,652,2.52,1967.64
Other / Non-Disclosed,15,0.06,50.19

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [59]:
# Create bins in which to place values based upon Age counts
bins_to_fill = [0, 10, 15, 20, 25, 30, 35, 40, 200]

# Create labels for these bins
group_labels = [ "<10" , "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "+40"]

assert len(bins_to_fill) == len(group_labels) + 1

purchase_data["Age Group"] = pd.cut(
    x=purchase_data["Age"], 
    bins=bins_to_fill, 
    labels=group_labels,
    right=False
)
#purchase value by age
purchase_data_count_age = purchase_data["Age Group"].value_counts()

SN_counter = len(SN_unique["SN"].value_counts())

percentage_data_count_age = purchase_data_count_age/SN_counter*100


percentage_data_count_age

# Create a GroupBy object based upon "Age Group"
Age_Group = purchase_data.groupby(by="Age Group")

Age_Group_df = pd.DataFrame({
                            'Total Count': purchase_data_count_age,
                            'Percentage of Players': percentage_data_count_age})

Age_Group_df['Percentage of Players'].round(2)


Age_Group_df.sort_index(ascending=True)

       Total Count  Percentage of Players
<10             23               3.993056
10-14           28               4.861111
15-19          136              23.611111
20-24          365              63.368056
25-29          101              17.534722
30-34           73              12.673611
35-39           41               7.118056
+40             13               2.256944

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [77]:
# Create bins in which to place values based upon Age counts
bins_to_fill = [0, 10, 15, 20, 25, 30, 35, 40, 200]

# Create labels for these bins
group_labels = [ "<10" , "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "+40"]

assert len(bins_to_fill) == len(group_labels) + 1

purchase_data["Age Group"] = pd.cut(
    x=purchase_data["Age"], 
    bins=bins_to_fill, 
    labels=group_labels,
    right=False
)

purchase_data.head(20)

# purchase count by age
Age_count = purchase_data["Age Group"].value_counts()
Age_count
# purchase value by age
Age_Purchase_value = purchase_data.groupby("Age Group").Price.sum()
Age_Purchase_value
# Average purchase by age
Age_average = Age_Purchase_value/Age_count
Age_average
# Average age per person
Age_Avg_person = (Age_Purchase_value/Age_count)
Age_Avg_person


Age_Analysis_df = pd.DataFrame({
                              'Purchase Count': Age_count,
                              'Average Purchase Price': Age_average,
                              'Total Purchase Value': Age_Purchase_value,
                              'Avg Total Purchase per Person': Age_Avg_person
                              })
Age_Analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,3.353478,77.13,3.353478
10-14,28,2.956429,82.78,2.956429
15-19,136,3.035956,412.89,3.035956
20-24,365,3.052219,1114.06,3.052219
25-29,101,2.900990,293.00,2.900990
30-34,73,2.931507,214.00,2.931507
35-39,41,3.601707,147.67,3.601707
+40,13,2.941538,38.24,2.941538

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [62]:
grouped_SN_df = purchase_data.groupby(['SN'])
avg_Purchase = grouped_SN_df["Price"].mean()
sum_Purchase = grouped_SN_df["Price"].sum()
count_Purchase = grouped_SN_df["Price"].value_counts()

# Creating a new DataFrame using mean, sum, counts
SN_summary = pd.DataFrame({"Purchase Count": count_Purchase,
                             "Average Purchase Price": avg_Purchase,
                           "Total Purchase Value": sum_Purchase
                          })
SN_summary.head()

C:\Users\quiqu\anaconda3\lib\site-packages\pandas\core\indexes\multi.py:3585: RuntimeWarning: The values in the array are unorderable. Pass `sort=False` to suppress this warning.
  uniq_tuples = lib.fast_unique_multiple([self._values, other._values], sort=sort)

,,Purchase Count,Average Purchase Price,Total Purchase Value
SN,,,,
Adairialis76,2.28,1.0,NaN,NaN
Adastirin33,4.48,1.0,NaN,NaN
Aeda94,4.91,1.0,NaN,NaN
Aela59,4.32,1.0,NaN,NaN
Aelaria33,1.79,1.0,NaN,NaN

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

NameError: name 'Data_file_df' is not defined

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80